# User Defined Function (example from last week)
---

In [1]:
# Does a string contain any substrings that are palindromes?
## Palindrome: a string that reads the same forwards and backwards

# first, create a function that checks if a string is a palindrome
# second, create a function that gets all the substrings of a given string
# third, prints all substrings of a string that are palindromes

In [5]:
# checks if a string is a palindrome
def testing_palindrome(word:str):
    
    # reverse the word
    reverse_word = word[::-1]
    
    # compare reverse and word
    if reverse_word.lower() == word.lower():
        return True
    
    else:
        return False

In [6]:
testing_palindrome("data")

False

In [7]:
testing_palindrome("Racecar")

True

In [10]:
# function that gets all the substrings of a given string
def get_substrings(full_string:str):
    
    # create a list to put substrings in
    substrings = []
    
    for i in range(len(full_string)):
        
        for j in range(i, len(full_string)):
            
            substrings.append(full_string[i:j+1])
            
    substrings = set(substrings)
    return substrings

In [11]:
test_substrings = get_substrings("testing")

In [13]:
# prints all substrings of a string that are palindromes
def print_substring_palindromes(a_string:str):
    
    substrings = get_substrings(a_string)
    
    for s in substrings:
        
        if len(s) > 1 and testing_palindrome(s) == True:
            
            print(s)

In [14]:
print_substring_palindromes("google")

oo
goog

In [16]:
print_substring_palindromes("DataScience542")

ata

# NumPy examples
---

In [17]:
import numpy as np

In [19]:
# make a list of 10,000,000 integers as a ndarray and python list

my_list = list(range(0,10000000))

np_arr = np.arange(10000000)

In [20]:
# how long will it take to multiply that list by 2, ten differnt times

%time for i in range(10): np_arr = np_arr * 2

Wall time: 182 ms

In [21]:
%time for i in range(10): my_list2 = [x * 2 for x in my_list]

Wall time: 7.83 s

In [22]:
# numpy is usually between 10 and 100 times faster than a python list

In [23]:
test_list = [1,2,3,4]
test_list * 2

[1, 2, 3, 4, 1, 2, 3, 4]

In [24]:
arr = np.array([[1,2,3], [4,5,6]])

In [25]:
type(arr)

numpy.ndarray

In [26]:
arr

array([[1, 2, 3],
       [4, 5, 6]])

In [27]:
arr[0]

array([1, 2, 3])

In [28]:
arr[1]

array([4, 5, 6])

In [29]:
arr[1][1]

5

In [30]:
arr_3d = np.array([[1, 2, 3],
                  [4, 5, 6],
                  [7, 8, 9]])

In [31]:
arr_3d

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [32]:
arr_3d.shape

(3, 3)

In [33]:
arr_3d.size

9

In [34]:
print(arr_3d.T)

[[1 4 7]
 [2 5 8]
 [3 6 9]]

# Intro to Pandas
---

In [2]:
import pandas as pd

data = {"Ohio" : 35000,
       "Texas" : 71000,
       "Orgeon" : 16000,
       "Utah" : 5000}

series_example = pd.Series(data)

In [3]:
series_example

Ohio      35000
Texas     71000
Orgeon    16000
Utah       5000
dtype: int64

In [5]:
series_example.index

Index(['Ohio', 'Texas', 'Orgeon', 'Utah'], dtype='object')

In [6]:
series_example.shape

(4,)

In [9]:
# create Series from a list

series_example_2 = pd.Series([4, 7, -5, 3])

In [8]:
series_example_2

0    4
1    7
2   -5
3    3
dtype: int64

In [41]:
series_example_2.index = ["Bob", "Tracy", "Lauren", "Lisa"]

In [42]:
series_example_2

Bob       4
Tracy     7
Lauren   -5
Lisa      3
dtype: int64

In [43]:
series_example_2.index.name = "Salespeople"

In [44]:
series_example_2

Salespeople
Bob       4
Tracy     7
Lauren   -5
Lisa      3
dtype: int64

In [45]:
# create a dataframe from a dictionary

data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
       "year" : [2000, 2001, 2002, 2000, 2001, 2002],
       "population" : [1.5, 1.7, 1.8, 2.4, 2.9, 3.2]}

df = pd.DataFrame(data)

In [46]:
df

    state  year  population
0    Ohio  2000         1.5
1    Ohio  2001         1.7
2    Ohio  2002         1.8
3  Nevada  2000         2.4
4  Nevada  2001         2.9
5  Nevada  2002         3.2

In [49]:
df.head(2)

  state  year  population
0  Ohio  2000         1.5
1  Ohio  2001         1.7

In [50]:
df.tail(1)

    state  year  population
5  Nevada  2002         3.2

In [51]:
df.columns

Index(['state', 'year', 'population'], dtype='object')

In [52]:
for c in df.columns:
    print(f"doing something with column {c}")

doing something with column state
doing something with column year
doing something with column population

In [53]:
df["growth"] = None

In [54]:
df

    state  year  population growth
0    Ohio  2000         1.5   None
1    Ohio  2001         1.7   None
2    Ohio  2002         1.8   None
3  Nevada  2000         2.4   None
4  Nevada  2001         2.9   None
5  Nevada  2002         3.2   None

In [55]:
# create a dataframe from a list

# initialize list of lists
data = [["tom", 10], ["nick", 15], ["julie", 14]]

df2 = pd.DataFrame(data, columns = ["Name", "Age"])

In [56]:
df2

    Name  Age
0    tom   10
1   nick   15
2  julie   14